-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Jan 09, 2025 at 08:10 AM
-- Server version: 8.0.30
-- PHP Version: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `testweb`
--

-- --------------------------------------------------------

--
-- Table structure for table `processed`
--

CREATE TABLE `processed` (
  `id` int NOT NULL,
  `working_code` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `item_code` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `format_item_code` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `total_quantity` int NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `remarks` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci,
  `packing_size` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `total_value` decimal(15,2) NOT NULL,
  `status` enum('อนุมัติ','รออนุมัติ','ยกเลิกใบเบิก','Completed') CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `purchase_status` enum('GPO','จัดซื้อบริษัท') CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `processed_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `processed`
--

INSERT INTO `processed` (`id`, `working_code`, `item_code`, `format_item_code`, `total_quantity`, `price`, `remarks`, `packing_size`, `total_value`, `status`, `purchase_status`, `processed_at`) VALUES
(4, '1000010', 'Acyclovir 400 mg tab', ' กล่อง', 8, '198.00', '', '70 เม็ด/กล่อง', '1584.00', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(5, '1000020', 'Albendazole 200 mg tab               ', ' กล่อง', 28, '165.00', '', '100 เม็ด/กล่อง', '4620.00', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(6, '1000030', 'Amitryptyline HCl 10 mg tab                 ', ' กล่อง', 3, '166.92', '', '500เม็ด/กล่อง', '500.76', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(7, '1000040', 'Amoxycillin trihydrate 250 mg cap                ', ' กล่อง', 8, '485.00', '', '500เม็ด/กล่อง', '3880.00', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(8, '1000050', 'Amoxycillin trihydrate 500 mg cap      ', ' กล่อง', 26, '855.00', '', '500เม็ด/กล่อง', '22230.00', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(9, '1000060', 'Betahistine 6 mg tab', 'กล่อง', 2, '250.00', '', '500เม็ด/กล่อง', '500.00', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(10, '1000070', 'Bisacodyl 5 mg enteric coated tab                 ', 'กล่อง', 10, '150.00', '', '100 เม็ด/กล่อง', '1500.00', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(11, '1000080', 'Calcium carbonate 600 mg tab', ' กระปุก', 62, '250.00', '', '500 เม็ด/กระปุก', '15500.00', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(12, '1000090', 'Cetirizine 10 mg tab', 'กล่อง', 51, '25.00', '', '100เม็ด/กล่อง', '1275.00', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(13, '1000100', 'Chlorpheniramine maleate 4 mg tab', ' กล่อง', 618, '6.90', '', '100 เม็ด/กล่อง', '4264.20', 'อนุมัติ', 'GPO', '2025-01-07 05:23:09'),
(14, '1000110', 'Clindamycin 300 mg cap', ' กล่อง', 3, '260.00', '', '100 เม็ด/กล่อง', '780.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(15, '1000120', 'Dextromethorphan15 mg tab', ' กระปุก', 26, '450.00', '', '1000 เม็ด/กระปุก', '11700.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(16, '1000130', 'Diazepam 2 mg tab             ', ' กระปุก', 2, '90.00', '', '500 เม็ด/กระปุก', '180.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(17, '1000140', 'Diclofenac sodium 25 mg tab         ', ' กระปุก', 51, '120.00', '', '1000 เม็ด/กระปุก', '6120.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(18, '1000150', 'Dicloxacillin sodium 250 mg cap', ' กล่อง', 40, '555.00', '', '500เม็ด/กล่อง', '22200.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(19, '1000160', 'Dimenhydrinate 50 mg tab               ', ' กระปุก', 21, '165.00', '', '1000 เม็ด/กระปุก', '3465.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(20, '1000170', 'Domperidone maleate 10 mg tab             ', ' กระปุก', 14, '160.00', '', '1000 เม็ด/กระปุก', '2240.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(21, '1000180', 'Ergotamine1 mg + Caffeine 100 mg tab', ' แผง', 40, '24.00', '', '10 เม็ด/แผง', '960.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(22, '1000190', 'Ferrous fumarate 200 mg tab', ' กระปุก', 17, '140.00', '', '1000 เม็ด/กระปุก', '2380.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(23, '1000200', 'Fluoxetine hydrochloride 20 mg cap', ' กล่อง', 2, '249.31', '', '500เม็ด/กล่อง', '498.62', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(24, '1000210', 'Folic acid 5 mg tab                    ', ' กระปุก', 35, '224.70', '', '1000 เม็ด/กระปุก', '7864.50', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(25, '1000220', 'Glyceryl guaiacolate  100 mg  Tab', 'กระปุก', 29, '500.00', '', '1000 เม็ด/กระปุก', '14500.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(26, '1000230', 'Griseofulvin 500 mg tab', 'กล่อง', 1, '950.00', '', '500 เม็ด/กล่อง', '950.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(27, '1000240', 'Hydroxyzine hydrochloride 10 mg tab', ' กระปุก', 13, '130.00', '', '1000 เม็ด/กระปุก', '1690.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(28, '1000250', 'Hyoscine-N-butylbromide 10 mg tab', 'กล่อง', 52, '95.00', '', '100 เม็ด/กล่อง', '4940.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(29, '1000260', 'Ibuprofen 400 mg flim coated tab ', ' กระปุก', 20, '370.00', '', '1000 เม็ด/กระปุก', '7400.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(30, '1000270', 'Loratadine 10 mg tab', 'กล่อง', 32, '55.00', '', '10 เม็ด/แผง*10แผง', '1760.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(31, '1000280', 'Lorazepam 1 mg tab', ' กระปุก', 2, '350.00', '', '1000 เม็ด/กระปุก', '700.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(32, '1000290', 'Metronidazole 200 mg tab         ', 'กล่อง', 2, '350.00', '', '500 เม็ด/กล่อง', '700.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(33, '1000300', 'Norfloxacin 400 mg  tab           ', ' กระปุก', 43, '100.00', '', '100 เม็ด/กระปุก', '4300.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(34, '1000310', 'Omeprazole  20 mg cap     ', ' กล่อง', 257, '55.00', '', '100 เม็ด/กล่อง', '14135.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(35, '1000320', 'Paracetamol 325 mg tab               ', ' กระปุก', 6, '180.00', '', '1000 เม็ด/กระปุก', '1080.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(36, '1000330', 'Paracetamol 500 mg tab                 ', ' กล่อง', 172, '225.00', '', '500เม็ด/กล่อง', '38700.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(37, '1000350', 'Prednisolone 5 mg tab               ', ' กระปุก', 1, '175.58', '', '500 เม็ด/กระปุก', '175.58', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(38, '1000360', 'Roxithromycin 150 mg tab', ' แผง', 115, '12.00', '', '10 เม็ด/แผง', '1380.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(39, '1000370', 'Simethicone 80 mg chewable tab', 'กล่อง', 84, '290.00', '', '500เม็ด/กล่อง', '24360.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(40, '1000380', 'Tramadol hydrochloride 50 mg cap', 'กล่อง', 30, '180.00', '', '100 เม็ด/กล่อง', '5400.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(41, '1000390', 'Triferdine (Potassium iodine 0.15 mg.+Folic acid 0.4 mg.+Iron 60.81 mg.)', 'ขวด', 556, '35.31', '', '30 เม็ด/ขวด', '19632.36', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(42, '1000400', 'Vitamin B1 (Thiamine HCl) 100 mg Tab              ', ' กระปุก', 19, '395.00', '', '1000 เม็ด/กระปุก', '7505.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(43, '1000410', 'Albendazole 400mg/20 mL susp- 20 mL', 'ขวด', 192, '14.45', '', '1 ขวด', '2774.40', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(44, '1000420', 'Amoxycillin  125 mg/5 mL dry syr- 60 mL', 'ขวด', 464, '13.00', '', '1 ขวด', '6032.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(45, '1000430', 'Chlorpheniramine 2 mg/5 mL syr- 60 mL', 'ขวด', 1640, '8.56', '', '1 ขวด', '14038.40', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(46, '1000440', 'Dextromethorphan 5mg/5 mL syr- 60 mL', 'ขวด', 10, '15.00', '', '1 ขวด', '150.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(47, '1000450', 'Dicloxacillin 62.5 mg/5 mL dry syr- 60 mL', 'ขวด', 326, '22.00', '', '1 ขวด', '7172.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(48, '1000460', 'Domperidone 5 mg/5 mL susp- 30 mL', 'ขวด', 330, '7.50', '', '1 ขวด', '2475.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(49, '1000470', 'Erythromycin 125 mg/5mL dry syr-60mL  ', 'ขวด', 38, '17.00', '', '1 ขวด', '646.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(50, '1000480', 'Ferrous fumarate 45 mg/0.6 mL syr (drop) -15 mL', 'ขวด', 521, '27.00', '', '1 ขวด', '14067.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(51, '1000490', 'Glyceryl guaiacolate100mg/5ml syr-60 mL ', 'ขวด', 1225, '13.91', '', '1 ขวด', '17039.75', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(52, '1000500', 'Hyoscine-n-butyl. 5 mg/5 ml syr-30 ML', 'ขวด', 70, '13.00', '', '1 ขวด', '910.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(53, '1000510', 'Eurofer Iron (III) Hydroxide Polymaltose Complex 10mg/ml-60ml', 'ขวด', 20, '59.00', '', '1 ขวด', '1180.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(54, '1000520', 'Milk of Magnesia (MOM)  susp - 60 mL  ', 'ขวด', 85, '10.17', '', '1 ขวด', '864.45', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(55, '1000530', 'Mixt.Carminative- 180 mL                ', 'ขวด', 342, '16.05', '', '1 ขวด', '5489.10', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(56, '1000540', 'Opium Glycerhiza mixt (M.Tussis/Brown mixture)- 60 mL  ', 'ขวด', 200, '12.84', '', '1 ขวด', '2568.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(57, '1000550', 'Oral rehydration salts (ORS) 5.09 gm', 'กล่อง', 33, '180.00', '', '100 ซอง/กล่อง', '5940.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(58, '1000560', 'Oral rehydration salts (ORS-ส้ม) 4.201 gm ', 'กล่อง', 24, '142.00', '', '100 ซอง/กล่อง', '3408.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(59, '1000570', 'Paracetamol 120 mg/5 mL syr-60 mL     ', 'ขวด', 1630, '9.63', '', '1 ขวด', '15696.90', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(60, '1000580', 'Co-trimoxazole susp- 60 mL Sulfamethoxazole 200 mg+ Trimethoprim40 mg/ 5 mL ', 'ขวด', 5, '12.00', '', '1 ขวด', '60.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(61, '1000590', 'Dimenhydrinate 50 mg/1 mL inj', 'กล่อง', 9, '50.00', '', '10 แอมพูล/กล่อง', '450.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(62, '1000600', 'HYOSCINE-N-BUTYLBROMIDE INJECTION 20 mg/ml 1 ml', 'แอมพลู', 20, '10.25', '', '1 แอมพลู', '205.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(63, '1000610', 'LIDOCAINE HYDROCHLORIDE INJECTION 2%w/v 20 ml vial', 'ขวด', 63, '41.20', '', '1 ขวด', '2595.60', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(64, '1000620', 'Metocloplamide HCl 10 mg/2 mL inj      ', 'แอมพลู', 10, '6.42', '', '1 แอมพลู', '64.20', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(65, '1000630', 'Tetanus vaccine (Tetanus toxoid) 0.5 mL inj ', 'แอมพลู', 490, '30.00', '', '1 แอมพลู', '14700.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(66, '1000640', 'Sodium chloride 0.9% inj- 5 mL ampule', 'แอมพลู', 10, '4.90', '', '1 แอมพลู', '49.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(67, '1000650', 'Water for injection-10mL plastic ampule', 'แอมพลู', 80, '8.00', '', '1 แอมพลู', '640.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(68, '1000660', 'Hista-oph  Antazoline HCl 0.05%+ Tetrahydrozoline HCl 0.04% eye drop- 10 mL', 'ขวด', 826, '32.00', '', '1 ขวด', '26432.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(69, '1000670', 'Chloramphenicol 0.5% eye drop-10 mL    ', 'ขวด', 45, '23.50', '', '1 ขวด', '1057.50', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(70, '1000680', 'Chloramphenicol 1.0% ear drop-10 mL', 'ขวด', 30, '25.50', '', '1 ขวด', '765.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(71, '1000690', 'Clotrimazole vaginal 100 mg tab  ', 'เม็ด', 78, '15.90', '', '6 เม็ด/กล่อง', '1240.20', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(72, '1000700', 'Lubricating gel- 50 gm   ', 'หลอด', 57, '33.00', '', '1หลอด', '1881.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(73, '1000710', 'Alcohol 70%- 450 mL', 'ขวด', 467, '27.82', '', '1 ขวด', '12991.94', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(74, '1000720', 'Alcohol 70%- 60 mL', 'ขวด', 72, '7.49', '', '1 ขวด', '539.28', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(75, '1000730', 'Alcohol 95%- 450 mL (แบ่งบรรจุ)', 'ขวด', 25, '120.00', '', '1 ขวด', '3000.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(76, '1000740', 'Aromatic ammonia spirit-30 mL', 'ขวด', 97, '12.00', '', '1 ขวด', '1164.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(77, '1000750', 'Benzoic+Salicylic acid (Withfield ointment)', 'หลอด', 44, '12.00', '', '1หลอด', '528.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(78, '1000760', 'Benzyl benzoate 25% emulsion- 60 mL         ', 'ขวด', 200, '19.00', '', '1 ขวด', '3800.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(79, '1000770', 'Betamethasone val. 0.1% cream- 5 g', 'หลอด', 140, '8.56', '', '1 หลอด', '1198.40', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(80, '1000780', 'Calamine lotion- 60 mL', 'ขวด', 465, '14.98', '', '1 ขวด', '6965.70', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(81, '1000790', 'Chlorhexidine glu.scrub 4%- 450 mL ', 'ขวด', 47, '115.00', '', '1 ขวด', '5405.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(82, '1000800', 'Clotrimazole 1% cream- 15 gm', 'หลอด', 547, '30.00', '', '1 หลอด', '16410.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(83, '1000810', 'Glycerin borax-10 mL - 15 ml', 'ขวด', 28, '15.00', '', '1 ขวด', '420.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(84, '1000820', 'HYDROGEN PEROXIDE SOLUTION 20 VOL 450 ml ', 'ขวด', 14, '26.75', '', '1 ขวด', '374.50', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(85, '1000830', 'Iodine Povidine scrub 7.5%- 450 mL', 'ขวด', 31, '115.00', '', '1 ขวด', '3565.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(86, '1000840', 'Methylsalicylate 15% cream- 15 g ระกำ', 'หลอด', 2940, '13.91', '', '1 หลอด', '40895.40', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(87, '1000850', 'Povidone-Iodine sol 10%- 30 mL', 'ขวด', 55, '16.23', '', '1 ขวด', '892.65', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(88, '1000860', 'Povidone-Iodine sol 10%- 450 mL', 'ขวด', 48, '120.00', '', '1 ขวด', '5760.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:09'),
(89, '1000870', 'Silver sulfadiazine 1% cream- 25 gm  ', 'หลอด', 94, '29.00', '', '1 หลอด', '2726.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(90, '1000880', 'Sodium chloride for irrigation-100 mL ', 'ขวด', 262, '24.00', '', '1 ขวด', '6288.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(91, '1000890', 'Sodium chloride for irrigation-1000 mL ', 'ขวด', 961, '29.40', '', '1 ขวด', '28253.40', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(92, '1000900', 'Triamcinolone acetonide 0.02% cream-5gm                       ', 'หลอด', 264, '12.98', '', '1 หลอด', '3426.72', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(93, '1000910', 'Triamcinolone 0.1% cream-5 gm                      ', 'หลอด', 942, '8.56', '', '1 หลอด', '8063.52', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(94, '1000920', 'Triamcinolone acetonide 0.1% in oral base', 'หลอด', 326, '4.70', '', '1 หลอด', '1532.20', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(95, '1000930', 'Zinc oxide paste- 5 gm         ', 'หลอด', 52, '14.00', '', '1 หลอด', '728.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(96, '1000940', 'Adrenaline (Epinephrine) inj. 1 mg/1ml', 'แอมพลู', 30, '6.00', '', '1 แอมพลู', '180.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(97, '1000950', 'Chlorpheniramine maleate 10 mg/1 mL inj', 'แอมพลู', 54, '2.24', '', '1 แอมพลู', '120.96', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(98, '1000960', 'D-50-W inj. 50 ml (Glucose 50%)', 'ขวด', 14, '25.00', '', '1 ขวด', '350.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(99, '1000970', 'D-5-S inj- 1000 mL', 'ขวด', 12, '34.00', '', '1 ขวด', '408.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(100, '1000980', 'D-5-W inj- 1000 mL                  ', 'ขวด', 10, '47.00', '', '1 ขวด', '470.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(101, '1000990', 'Dexamethasone phosphate 4 mg/1 mL inj', 'Amp', 21, '4.20', '', '1 amp', '88.20', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(102, '1001000', 'Isosorbide dinitrate 5 mg sublingual tab', ' แผง', 11, '11.00', '', '10 เม็ด/แผง', '121.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(103, '1001010', 'Sodium chloride 0.9% inj- 1000 mL', 'ขวด', 32, '33.00', '', '1 ขวด', '1056.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(104, '1001020', 'ขมิ้นชัน 500 mg cap', 'กล่อง', 22, '270.00', '', '500 เม็ด/กล่อง', '5940.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(105, '1001030', 'ครีมไพล 14% cream- 30 g', 'หลอด', 552, '34.24', '', '1 หลอด', '18900.48', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(106, '1001040', 'พญายอ (ครีม) cream- 5 gm ', 'หลอด', 147, '42.80', '', '1 หลอด', '6291.60', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(107, '1001050', 'ฟ้าทะลายโจร 250-500 mg cap', 'กล่อง', 40, '77.04', '', '500 เม็ด/กล่อง', '3081.60', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(108, '1001060', 'ยาแก้ไอมะขามป้อม 120 ml', 'ขวด', 1200, '16.05', '', '1 ขวด', '19260.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(109, '1001070', 'ยาเถาวัลย์เปรียง 600 มก.', 'กล่อง', 15, '330.00', '', '500 เม็ด/กล่อง', '4950.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(110, '1001080', 'ยาเพชรสังฒาต 400 cap', 'กล่อง', 11, '330.00', '', '500 เม็ด/กล่อง', '3630.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(111, '1001090', 'ยามะขามแขก 250 มก. Tab', 'กล่อง', 16, '275.00', '', '500 เม็ด/กล่อง', '4400.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(112, '1001100', 'ยาเม็ดอมมะแว้ง (ประสะมะแว้ง) 20ซอง*20 เม็ด', 'กล่อง', 39, '88.80', '', '400 เม็ด/กล่อง', '3463.20', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(113, '1001110', 'ยารางจืด (ชารางจืด)', ' ถุง', 48, '52.00', '', '20 ซอง/ถุง', '2496.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(114, '1001120', 'ยาหอมเทพจิตร', 'กล่อง', 10, '180.00', '', '400 ซอง/กล่อง', '1800.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(115, '1001130', 'ลูกประคบสมุนไพร ยาประคบ', 'ลูก', 388, '47.00', '', '1 ลูก', '18236.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(116, '1001140', 'ยาคุมแบบเม็ด Levonorgestrel 150 mcg+ Ethinyl estradiol 30 mcg tab', 'กล่อง', 25, '385.00', '', '50 แผง/กล่อง', '9625.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(117, '1001150', 'ยาคุมฉีด Medroxyprogesterone  acetate 150 mg/3 mL inj- vial', 'Vial', 1350, '11.00', '', '1 Vial', '14850.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(118, '1001160', 'Benzocaine 20% gel- 30 gm', 'หลอด', 6, '100.00', '', '1 หลอด', '600.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(119, '1001170', 'Erythrocin 6% dye solution- 10 mL ', 'ขวด', 5, '24.00', '', '1 ขวด', '120.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(120, '1001180', 'Chlorhexidine gluconate 0.12% mouth wash-240 mL', 'ขวด', 40, '35.00', '', '1 ขวด', '1400.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(121, '1001190', 'Mepivacaine HCl 2%+ Epi 1:100,000 1.8ml', 'หลอด', 100, '13.00', '', '1 หลอด', '1300.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10'),
(122, '1001220', 'Special mouthwash (Dobell)- 240 mL', 'ขวด', 50, '26.00', '', '1 ขวด', '1300.00', 'อนุมัติ', 'จัดซื้อบริษัท', '2025-01-07 05:23:10');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `processed`
--
ALTER TABLE `processed`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `processed`
--
ALTER TABLE `processed`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=123;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
